import java.util.Arrays;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class main {

	public static void main(String[] args) {
		String str = "Кондитерська корпора́ція \"Рошен\" — один з найбільших виробників кондитерських виробів в Україні та Східній Європі, входить у тридцятку найбільших виробників кондитерських виробів світу. Головний офіс компанії розташовано у Києві." + 
				"Назва походить з прізвища її засновника — Петра Порошенка шляхом вилучення першого та останнього складів. На прес-конференції у 2015 році в Києві Петро Порошенко запевнив, що має намір передати свій пакет акцій кондитерської корпорації \"Рошен\" в управління інвестиційній банківській компанії Rothschild, що належить родині Ротшильдів. З січня 2016 Петро Порошенко передав свою частку \"Рошен\" у незалежний «сліпий» траст в управління трастовим фондом Rothschild Trust[1]";
		System.out.println(str);
		String[] str2 = str.split(" ");
		
		int count = 0;
		for (int i = 0; i < str2.length; i++) {
			if(Pattern.matches("\"Рошен\"", str2[i]))
				str2[i] = "MAN_" + ++count;
		}
		
		str = String.join(" ", str2);
		System.out.println(str);
	}

}
